## Staging: pr_review
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 18 to add, 0 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.pr_review_policy[0] will be created
  + resource "aws_ecr_lifecycle_policy" "pr_review_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "pr_review"
    }

  # aws_ecr_repository.pr_review_repository[0] will be created
  + resource "aws_ecr_repository" "pr_review_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "pr_review"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_role.forms_lambda_client[0] will be created
  + resource "aws_iam_role" "forms_lambda_client" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forms-lambda-client"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.cognito_forms_lambda_client[0] will be created
  + resource "aws_iam_role_policy_attachment" "cognito_forms_lambda_client" {
      + id   = (known after apply)
      + role = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.dynamodb_forms_lambda_client[0] will be created
  + resource "aws_iam_role_policy_attachment" "dynamodb_forms_lambda_client" {
      + id   = (known after apply)
      + role = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.kms_forms_lambda_client[0] will be created
  + resource "aws_iam_role_policy_attachment" "kms_forms_lambda_client" {
      + id   = (known after apply)
      + role = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.s3_forms_lambda_client[0] will be created
  + resource "aws_iam_role_policy_attachment" "s3_forms_lambda_client" {
      + id   = (known after apply)
      + role = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.secrets_manager_forms_lambda_client[0] will be created
  + resource "aws_iam_role_policy_attachment" "secrets_manager_forms_lambda_client" {
      + id   = (known after apply)
      + role = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.sqs_forms_lambda_client[0] will be created
  + resource "aws_iam_role_policy_attachment" "sqs_forms_lambda_client" {
      + id   = (known after apply)
      + role = "forms-lambda-client"
    }

  # aws_security_group.lambda_client_pr_review[0] will be created
  + resource "aws_security_group" "lambda_client_pr_review" {
      + arn                    = (known after apply)
      + description            = "Lambda admin PR review environment"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "lambda-admin-pr-review"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-staging"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
        }
      + vpc_id                 = "vpc-0ad5b3739860129d0"
    }

  # aws_security_group_rule.database_lambda_client_ingress[0] will be created
  + resource "aws_security_group_rule" "database_lambda_client_ingress" {
      + description              = "Security group rule for Forms DB ingress"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0b80bb714d886b8ff"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.internet_ingress_to_lambda_client[0] will be created
  + resource "aws_security_group_rule" "internet_ingress_to_lambda_client" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow inbound connections from the internet to the lambda PR review env"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.lambda_client_egress_database[0] will be created
  + resource "aws_security_group_rule" "lambda_client_egress_database" {
      + description              = "Security group rule for Forms DB egress to Database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0b80bb714d886b8ff"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.lambda_client_egress_privatelink[0] will be created
  + resource "aws_security_group_rule" "lambda_client_egress_privatelink" {
      + description              = "Security group rule for Forms egress through privatelink"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.lambda_client_egress_redis[0] will be created
  + resource "aws_security_group_rule" "lambda_client_egress_redis" {
      + description              = "Security group rule for Forms DB egress to Redis"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-092fddfbbac0e15aa"
      + to_port                  = 6379
      + type                     = "egress"
    }

  # aws_security_group_rule.lambda_client_egress_to_internet[0] will be created
  + resource "aws_security_group_rule" "lambda_client_egress_to_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound connections from lambda PR review env to the internet"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.privatelink_lambda_client_ingress[0] will be created
  + resource "aws_security_group_rule" "privatelink_lambda_client_ingress" {
      + description              = "Security group rule for Forms ingress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.redis_lambda_client_ingress[0] will be created
  + resource "aws_security_group_rule" "redis_lambda_client_ingress" {
      + description              = "Security group rule for Forms Redis ingress"
      + from_port                = 6479
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-092fddfbbac0e15aa"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.lambda_client_pr_review[0]"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
